return [[
〖长安城〗
                

                             ≌≌≌≌≌≌
                             ≌ [皇宫] ≌
                             ≌≌≌≌≌≌
                                  ｜
                                  ｜
         袁氏草堂      [清虚观]   ｜ [长安武馆]      [城隍庙]
            ｜            ｜      ｜      ｜            ｜
      [西门]－－－－－－－－－[十字街头]－－－－－－－－－－[东门]
            ｜            ｜      ｜      ｜            ｜
             ＼        [相记钱庄] ｜ [兵器铺]          ／
               西                 ｜                 东
                 ＼   [董记当铺]－十－[南城客栈]   ／
                   城             ｜             城
                    ｜[长安乐府]－十－[回春药铺]｜
                    ｜            ｜            ｜
                     －－－－－＊ ｜＊－－－－－
                                  ｜
                                [南城口]
]]
