return [[
≌西方≌
[昆仑派]
   ｜
[龙门镇]－ [凤翔府]
              ｜  ＼
              ｜ [华山]
              ｜
  [青城山] [蜀道]－－[剑门关]－－[伏牛山]
        ＼    ｜         ｜
 [峨嵋]－－[成都]    [暮雪山庄]－[武当派]
            ／＼
    [唐门]－    －[江津村]－[丰都]
      ｜             ｜
      ｜           [大理]
      ｜             ｜
      ┗[乌蒙部]－[点苍山]
                    ｜
                  [西双版纳]
≌东方≌
           [雁门关]－[大草原]－[王旗部落]
              ｜
  [汴京]－[汴京府东]－[二龙山]－[梁山泊]
    ｜          ｜                 ｜
 [少林派]   [天波杨府]－[丐帮]－[野猪林]
    ｜                    ｜
 [灵宝山]     [杏花村]－[扬州]－[云梦泽]
    ｜                    ｜
  [襄阳]               [龙泉村]－[武夷山]
     ＼                   ｜
   [武陵山]－－[五毒教]－[泉州]－[东海海滨]
      ｜                ／｜     	｜
    [苗岭]         [明教] ｜     [桃花岛]
                          ｜
                          ｜
                          ｜
                     [天涯海角]
]]
