local map = [[
紅魔館 ===============================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■
■　　　　　　　　　　　　[6] 　　　　　　　　│ [5]■
■　　　　　　　　　　　　　　　　　　　　　　■■■■
■　　　　　　　　　　　　　　　　　　　　　　　　　■
■　　■■■■■■■■■■―■■■■■■■■■■　　■
■　　■　　　│　 [13]　　 ■■<[18] ■ [11] ■　　■
■　　■ [14] ■―■■■■■■■■■　■―■―■　　■
■　　■　　　■　l>　　 [17] 　　<l　■　　　■　　■
■　　■　　　│　￣￣￣】↑【￣￣￣　■　　　■　　■
■　　■■■■■　　　　　　　　　　　■　　　■　　■
■　　■[16]│　　　　　　[9] 　　　　│ [10] ■　　■
■　　■■■■―■■■■■―■■■■■■　　　■　　■
■　　　　■[15]■＿＿　　　　　  ＿＿■　　　■　　■
■　　　　■　　■　 ∥ 木　 木　∥　 ■―■―■　　■
■　　　　■　　■[8]∥ 木[2]木　∥[7]■ [12] ■　　■
■　　　　■■■■　 ∥ 木　 木　∥　 ■■■■■　　■
■　　　　　　　　￣￣　木　 木   ￣￣　　　　　　　■
■■■■　　　　　　　　木　 木 　　　　　　　■■■■
■ [3]│　　　　　　　　　　　 　　　　　　 　│[4] ■
■■■■■■■■■■■●  [1] ●■■■■■■■■■■■

]]
--print(map)
map = gsub(map, "%[(%d+)%]", function(id) 
	local s = string.format("<quad act=onMap(%s) a=[%s] width=%d />", id, id, #id)
	--print(s);
	return s;
end)
--print(map);
local tRoom = {
	[1]  = "正門 ",
	[2]  = "庭 ",
	[3]  = "守衛小屋 ",
	[4]  = "空的小屋 ",
	[5]  = "仓库 ",
	[6]  = "裏庭 ",
	[7]  = "東侧阳台 ",
	[8]  = "西侧阳台 ",
	[9]  = "大厅 ",
	[10] = "図書館 ",
	[11] = "帕秋莉私室 ",
	[12] = "小悪魔私室 ",
	[13] = "厨房 ",
	[14] = "食堂 ",
	[15] = "応接間 ",
	[16] = "一階厕所 ",
	[17] = "大楼梯 ",
	[18] = "地下楼梯 ",
}
local msg = ""
for i = 1, #tRoom do
	local btn = format("%2d : %-10s", i, tRoom[i])
	msg = msg .. format("<quad act=onMap(%d) a=[%s] width=%d />", i, btn, 1);
	if math.fmod(i, 4) == 0 then
		msg = msg .. "\n"
	end
end
--print(msg);
return map .. msg;
